{"_id":{"$oid":"60856fceb4a3e99cb6a59db0"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as a suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"Actors":["Anthony Hopkins"]}
{"_id":{"$oid":"608594ecb4a3e99cb6a59db1"},"Title":"Frida","Description":"An American biographical drama film which depicts the professional and private life of the surrealist Mexican artist Frida Kahlo.","Genre":{"Name":"Drama","Description":"The drama genre is defined by conflict and often looks to reality rather than sensationalism. Emotions and intense situations are the focus, but where other genres might use unique or exciting moments to create a feeling, movies in the drama genre focus on common occurences."},"Director":{"Name":"Julie Taymor","Bio":"Julie Taymor is an American director and writer of theater, opera, and film. She won Best Director for Lion King.","Birth":{"$date":{"$numberLong":"-537926400000"}}},"ImageURL":"https://images-na.ssl-images-amazon.com/images/l/61pVhTVc2tL._SX408_Bo1,204,203,200_.jpg","Featured":true,"Cast":["Salma Hayek","Alfred Molina","Geoffrey Rush"],"ReleaseDate":{"$date":"2002-01-01T00:00:00Z"}}
{"_id":{"$oid":"6089697bdc1db8dcc3ff386c"},"Title":"Boyhood","Description":"The life of Mason, from early childhood to his arrival at college.","Genre":{"Name":"Drama","Description":"The drama genre is defined by conflict and often looks to reality rather than sensationalism. Emotions and intense situations are the focus, but where other genres might use unique or exciting moments to create a feeling, movies in the drama genre focus on common occurrences."},"Director":{"Name":"Richard Linklater","Bio":"An American film director, producer, and screenwriter. He is known for films that revolve mainly around suburban culture and the effects of the passage of tiem.","Birth":"1960-07-30"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BMTYzNDc2MDc0N15BM15BM15BanBnXkFtZTgwOTcwMDQ5MTE@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true,"Cast":["Ellar Coltrane","Patricia Arquette","Ethan Hawke"],"ReleaseDate":"2014"}
{"_id":{"$oid":"60896bdcdc1db8dcc3ff386d"},"Title":"Seven","Description":"Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.","Genre":{"Name":"Crime","Description":"The crime genre deals with both sides of the criminal justice system but does not focus on legislative matters or civil suits and legal actions. The best crime movies often occupy moral gray areas where heroes and villians are much harder to define."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American film director known for his psychological thrillers. His films have received 40 nominations at the Academy Awards, including three for Best Director.","Birth":"1962-08-28"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BOTUwODM5MTctZjczMi00OTk4LTg3NWUtNmVhMTAzNTNjYncyXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182,288_AL_.jpg","Featured":false,"Cast":["Morgan Freeman","Brad Pitt","Kevin Spacey"],"ReleaseDate":"1995"}
{"_id":{"$oid":"60896e29dc1db8dcc3ff386e"},"Title":"Casablanca","Description":"Set in WWII, it focuses on an American expatriate who much choose between his love for a woman and helping her and her husband, a escape from the Vichy-controlled city of Casablanca to continue his fight against the Germans.","Genre":{"Name":"Drama","Description":"The drama genre is defined by conflict and often looks to reality rather than sensationalism. Emotions and intense situations are the focus, but where other genres might use unique or exciting moments to create a feeling, movies in the drama genre focus on common occurrences."},"Director":{"Name":"Michael Curtiz","Bio":"Mano Kertesz Kaminer was a Hungarian-born American film director, recognized as one of the most prolific directors in history. Curtiz was already a well-known director in Europe when Warner Bros invited him to Hollywood in 1926.","Birth":"1886-12-24","Death":"1962-04-11"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BY2IzZGY2YmEtYzljNS00NTM5LTgwMzUtMzM1NjQ4NGI0OTk0XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true,"Cast":["Humphrey Bogart","Ingrid Bergman","Paul Henreid"],"ReleaseDate":"1941"}
{"_id":{"$oid":"60897165dc1db8dcc3ff386f"},"Title":"Across the Universe","Description":"The music of The Beatles and the Vietnam War form the backdrop for the romance between an upper-class American girl and a poor Liverpudlian artist.","Genre":{"Name":"Drama","Description":"The drama genre is defined by conflict and often looks to reality rather than sensationalism. Emotions and intense situations are the focus, but where other genres might use unique or exciting moments to create a feeling, movies in the drama genre focus on common occurrences."},"Director":{"Name":"Julie Taymor","Bio":"Julie Taymor is an American director and writer of theater, opera, and film.She won Best Director for Lion King.","Birth":"1952-12-15"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BMTIyMTUwNzg3N15BMl5BMl5BanBnXkFtZTcwMjM1MDI1MQ@@._V1_WX182_CR0,0,18,268_AL_.jpg","Featured":false,"Cast":["Evan Rachel Wood","Jim Sturgess","Joe Anderson"],"ReleaseDate":"2007"}
{"_id":{"$oid":"60897497dc1db8dcc3ff3870"},"Title":"The Good, The Bad, and The Ugly","Description":"A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.","Genre":{"Name":"Western","Description":"Westerns are defined by their setting and time period.The story needs to take place in the American West, which begins as far east as Missouri and extends to the Pacific ocean. They're set during the 19th century, and will often feature horse riding, military expansion, violent and non-violent interaction with Native American tribes, the creation of railways, gunfights, and technology created during the industrial revolution."},"Director":{"Name":"Sergio Leone","Bio":"Sergio Leone was an Italian film director, producer, and screenwriter, credited as the creator of the Spaghetti Western genre and widely regarded as one of the most influential directors in the history of cinema.","Birth":"1929-01-03","Death":"1989-04-30"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BOTQ5NDI3MTI4MF5BMl5BanBnXkFtZTgwMDQ4ODE5MDE@._V1_UX182_CR0,0,182,268,_AL_.jpg","Featured":true,"Cast":["Clint Eastwood","Eli Wallach","Lee Van Cleef"],"ReleaseDate":"1966"}
{"_id":{"$oid":"60897638dc1db8dcc3ff3871"},"Title":"The Shawshank Redemption","Description":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","Genre":{"Name":"Drama","Description":"The drama genre is defined by conflict and often looks to reality rather than sensationalism. Emotions and intense situations are the focus, but where other genres might use unique or exciting moments to create a feeling, movies in the drama genre focus on common occurrences."},"Director":{"Name":"Frank Darabont","Bio":"Frank Arpad Darabont, born Ferenc Arpad Darabont, is a Hungarian-American film director, screenwriter and producer who has been nominated for three Academy Awards and a Golden Globe Award.","Birth":"1959-01-28"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BMDFkYTc0MGEtZmNhMC00ZDIzLWFmNTEtODM1ZmRlYWMwMWFmXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true,"Cast":["Tim Robbings","Morgan Freeman","Bob Gunton"],"ReleaseDate":"1994"}
{"_id":{"$oid":"608977d8dc1db8dcc3ff3872"},"Title":"Arsenic and Old Lace","Description":"A writer of books on the futility of marriage risks his reputation when he decides to get married. Things get even more complicated when he learns on his wedding day that his beloved maiden aunts are habitual murderers.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and mosts often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Frank Capra","Bio":"Frank Russell Capra, born Francesco Rosario Capra, was an Italian-born American film director, producer and writer who became the creative force behind some of the major award-winning films of the 30s and 40s. He won three Academy Awards for Best Director from six nominations, along with three other Oscar wins from nine nominations.","Birth":"1897-05-18","Death":"1991-09-03"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BZDVlNTBjMjctNjAzNS00ZGJhLTg2NzMtNzIwYTIzYTBiMDkyXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":true,"Cast":["Cary Grant","Priscilla Lane","Raymond Massey"],"ReleaseDate":"1944"}
{"_id":{"$oid":"60897b04dc1db8dcc3ff3873"},"Title":"Almost Famous","Description":"A high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies them on their concert tour.","Genre":{"Name":"Adventure","Description":"An adventure story is about a protagonist who journeys to epic or distant places to accomplish something. It can have many other genre elements included within it, because it is a very open genre. The protagonist has a mission and faces obstacles to get to theri destination. Also, adventure stories usually include unknown settings and characters with prized properties or features."},"Director":{"Name":"Cameron Crowe","Bio":"Cameron Bruce Crowe is an American director, producer, screenwriter, journalist, author,and actor. Before moving into the film industry, Crowe was a contributing editor at Rolling Stone Magazine, for which he still frequently writes.","Birth":"1957-07-13"},"ImageUrl":"https://m.media-amazon.com/images/M/MV5BMzY1ZjMwMGEtYTY1ZS00ZDllLTk0ZmUtYzA3ZTA4NmYwNGNkXkEyXkFqcGdeQXVyNDk3NDk2NzU2MTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","Featured":false,"Cast":["Billy Crudup","Patrick Rugit","Kate Hudson"],"ReleaseDate":"2000"}
